## Staging: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cache_buster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cache_buster"  {
      ~ id      = "119948190" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::729164266357:distribution/E355EOO70XE75H"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudfront_distribution.wordpress will be updated in-place
  ~ resource "aws_cloudfront_distribution" "wordpress" {
        id                             = "E355EOO70XE75H"
        tags                           = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (20 unchanged attributes hidden)



      ~ ordered_cache_behavior {
          ~ path_pattern               = "/sign-in-se-connecter*" -> "*/sign-in-se-connecter*"
          + response_headers_policy_id = "1a292c5b-9660-4e8b-93d8-090755837b5e"
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
          ~ path_pattern               = "*/wp-admin/*" -> "sign-in-se-connecter*"
          ~ response_headers_policy_id = "aa1748e3-f28c-436e-b9ce-c753fc1b8ad8" -> "1a292c5b-9660-4e8b-93d8-090755837b5e"
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
          ~ path_pattern               = "wp-admin/*" -> "*/wp-admin/*"
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
          ~ allowed_methods            = [
              + "DELETE",
              + "PATCH",
              + "POST",
              + "PUT",
                # (3 unchanged elements hidden)
            ]
          ~ default_ttl                = 86400 -> 0
          ~ max_ttl                    = 31536000 -> 0
          ~ path_pattern               = "/uploads/*" -> "wp-admin/*"
          + response_headers_policy_id = "aa1748e3-f28c-436e-b9ce-c753fc1b8ad8"
          ~ target_origin_id           = "wordpress_uploads" -> "wordpress"
            # (7 unchanged attributes hidden)

          ~ forwarded_values {
              ~ headers                 = [
                  + "Host",
                  + "User-Agent",
                    # (1 unchanged element hidden)
                ]
              ~ query_string            = false -> true
                # (1 unchanged attribute hidden)

              ~ cookies {
                  ~ forward           = "none" -> "all"
                    # (1 unchanged attribute hidden)
                }
            }
        }
      ~ ordered_cache_behavior {
          ~ allowed_methods        = [
              - "DELETE",
              - "PATCH",
              - "POST",
              - "PUT",
                # (3 unchanged elements hidden)
            ]
          ~ default_ttl            = 0 -> 86400
          ~ max_ttl                = 0 -> 31536000
          ~ path_pattern           = "wp-json/*" -> "/uploads/*"
          ~ target_origin_id       = "wordpress" -> "wordpress_uploads"
            # (7 unchanged attributes hidden)

          ~ forwarded_values {
              ~ headers                 = [
                  - "Authorization",
                  - "Host",
                  - "User-Agent",
                    # (1 unchanged element hidden)
                ]
              ~ query_string            = true -> false
                # (1 unchanged attribute hidden)

              ~ cookies {
                  ~ forward           = "all" -> "none"
                    # (1 unchanged attribute hidden)
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress                   = true
          + default_ttl                = 0
          + max_ttl                    = 0
          + min_ttl                    = 0
          + path_pattern               = "*/wp-json/*"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "wordpress"
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Authorization",
                  + "Host",
                  + "Origin",
                  + "User-Agent",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "all"
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress                   = true
          + default_ttl                = 0
          + max_ttl                    = 0
          + min_ttl                    = 0
          + path_pattern               = "wp-json/*"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "wordpress"
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Authorization",
                  + "Host",
                  + "Origin",
                  + "User-Agent",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "all"
                }
            }
        }

        origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


        # (4 unchanged blocks hidden)
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy_api will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_policy_api" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "gc-articles-security-headers-api"

      + custom_headers_config {
          + items {
              + header   = "X-Is-WP-API"
              + override = true
              + value    = "true"
            }
        }

      + security_headers_config {

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }
        }
    }

  # aws_iam_policy.cache_buster will be updated in-place
  ~ resource "aws_iam_policy" "cache_buster" {
        id        = "arn:aws:iam::729164266357:policy/cache_buster"
        name      = "cache_buster"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::729164266357:distribution/E355EOO70XE75H"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>